/* 
// 할 일 관리 클래스
- 할 일 입력 : 할 일을 추가할 수 있는데, name, tags, status를 입력받는다. -> 이름 중복 확인 -> id 부여 -> 할 일 추가
- 할 일 삭제 : 할 일의 이름을 입력해 삭제할 수 있다.
- 상태 업데이트 : 할 일의 상태를 업데이트 할 수 있으며, todo, doing, done의 3단계가 있다. -> 같은 상태로의 업데이트 확인 -> 업데이트
- 태그 추가 : 태그 명을 입력해 태그를 추가할 수 있다. -> 태그 중복 확인 -> 태그 추가
- 태그 삭제 : 태그 명을 입력해 삭제할 수 있다.
- 이름 변경 : 할 일의 이름을 변경할 수 있다. -> 이름 중복 확인 -> 이름 변경

// 할 일 보여주기 클래스
- 상태 보여주기 : all 입력 -> 모든 할 일의 상태 보여주기, 특정한 상태 입력 -> 상태에 맞는 할 일 보여주기
- 모든 할 일의 상태 보여주기 : all이 입력되었을 때, 모든 할 일 상태를 보여준다.
- 상태에 맞는 할 일 보여주기 : 특정한 상태가 입력되었을 때, 입력된 상태에 맞는 할 일을 모두 보여준다.
*/
